Repository: bsogulcan/another-iptv-player
Catalog: lib/l10n/app_*.arb
Languages: hi

# slogan
source: Open Source IPTV Player
hi: ओपन सोर्स IPTV प्लेयर

source: Search
hi: खोजें

source: Search live stream
hi: लाइव स्ट्रीम खोजें

source: Search movie
hi: फिल्म खोजें

source: Search series
hi: सीरियल खोजें

# not_found_in_category
source: No content found in this category
hi: इस श्रेणी में कोई सामग्री नहीं मिली

# live_stream_not_found
source: No live stream found
hi: कोई लाइव स्ट्रीम नहीं मिली

# movie_not_found
source: No movie found
hi: कोई फिल्म नहीं मिली

# see_all
source: View All
hi: सभी देखें

source: Preview
hi: पूर्वावलोकन

source: Info
hi: जानकारी

source: Close
hi: बंद करें

source: Reset
hi: रीसेट करें

source: Delete
hi: हटाएं

source: Cancel
hi: रद्द करें

source: Refresh
hi: रीफ्रेश करें

source: Back
hi: वापस

source: Clear
hi: साफ़ करें

source: Clear All
hi: सभी साफ़ करें

source: Day
hi: दिन

# clear_all_confirmation_message
source: Are you sure want to delete all history?
hi: क्या आप वाकई सारा इतिहास हटाना चाहते हैं?

source: Try Again
hi: फिर से कोशिश करें

source: History
hi: इतिहास

# history_empty_message
source: Your watched videos will appear here
hi: आपके देखे गए वीडियो यहाँ दिखाई देंगे

source: Live
hi: लाइव

source: Live Streams
hi: लाइव स्ट्रीम

# on_live
source: Live
hi: लाइव

source: Other Channels
hi: अन्य चैनल

source: Movies
hi: फिल्में

source: Movie
hi: फिल्म

# series_singular
source: Series
hi: सीरियल

# series_plural
source: Series
hi: सीरियल

source: Category ID
hi: श्रेणी ID

source: Channel Information
hi: चैनल की जानकारी

source: Channel ID
hi: चैनल ID

source: Series ID
hi: सीरियल ID

source: Quality
hi: गुणवत्ता

source: Stream Type
hi: स्ट्रीम प्रकार

source: Format
hi: फॉर्मेट

# season
source: Seasons
hi: सीज़न

# episode_count
source: {count} Episodes
hi: {count} एपिसोड

# duration
source: Duration: {duration}
hi: अवधि: {duration}

source: Episode Duration
hi: एपिसोड की अवधि

# creation_date
source: Added Date
hi: जोड़ने की तारीख

source: Release Date
hi: रिलीज़ की तारीख

source: Genre
hi: शैली

source: Cast
hi: कलाकार

source: Description
hi: विवरण

source: Video Track
hi: वीडियो ट्रैक

source: Audio Track
hi: ऑडियो ट्रैक

source: Subtitle Track
hi: सबटाइटल ट्रैक

source: Settings
hi: सेटिंग्स

source: General Settings
hi: सामान्य सेटिंग्स

source: App Language
hi: ऐप की भाषा

# continue_on_background
source: Continue Playing in Background
hi: बैकग्राउंड में चलाना जारी रखें

# continue_on_background_description
source: Keep playing even when app is in the background
hi: ऐप बैकग्राउंड में होने पर भी प्लेबैक जारी रखें

# refresh_contents
source: Refresh Content
hi: सामग्री रीफ्रेश करें

source: Subtitle Settings
hi: सबटाइटल सेटिंग्स

# subtitle_settings_description
source: Customize subtitle appearance
hi: सबटाइटल की दिखावट को कस्टमाइज़ करें

# sample_text
source: Sample subtitle text It will look like this
hi: नमूना सबटाइटल टेक्स्ट यह इस तरह दिखेगा

source: Font Settings
hi: फॉन्ट सेटिंग्स

source: Font Size
hi: फॉन्ट आकार

# font_height
source: Line Height
hi: लाइन की ऊंचाई

source: Letter Spacing
hi: अक्षर अंतराल

source: Word Spacing
hi: शब्द अंतराल

source: Padding
hi: पैडिंग

source: Color Settings
hi: रंग सेटिंग्स

source: Text Color
hi: टेक्स्ट रंग

source: Background Color
hi: बैकग्राउंड रंग

source: Style Settings
hi: स्टाइल सेटिंग्स

source: Font Weight
hi: फॉन्ट मोटाई

source: Thin
hi: पतला

source: Normal
hi: सामान्य

source: Medium
hi: मध्यम

source: Bold
hi: बोल्ड

# extreme_bold
source: Extra Bold
hi: अतिरिक्त बोल्ड

# text_align
source: Text Alignment
hi: टेक्स्ट संरेखण

source: Left
hi: बाएं

source: Center
hi: केंद्र

source: Right
hi: दाएं

source: Justify
hi: जस्टिफाई

source: Pick Color
hi: रंग चुनें

source: My Playlists
hi: मेरी प्लेलिस्ट

source: Create New Playlist
hi: नई प्लेलिस्ट बनाएं

source: Loading Playlists...
hi: प्लेलिस्ट लोड हो रही है...

source: Playlist List
hi: प्लेलिस्ट सूची

source: Playlist Information
hi: प्लेलिस्ट की जानकारी

source: Playlist Name
hi: प्लेलिस्ट का नाम

# playlist_name_placeholder
source: Name for your playlist
hi: अपनी प्लेलिस्ट के लिए नाम दर्ज करें

# playlist_name_required
source: Playlist name is required
hi: प्लेलिस्ट का नाम आवश्यक है

# playlist_name_min_2
source: Playlist should at least 2 character
hi: नाम में कम से कम 2 अक्षर होने चाहिए

# playlist_deleted
source: {name} deleted
hi: {name} हटा दी गई

# playlist_delete_confirmation_title
source: Delete Playlist
hi: प्लेलिस्ट हटाएं

# playlist_delete_confirmation_message
source: Are you sure you want to delete the playlist '{name}'? This action cannot be undone.
hi: क्या आप वाकई प्लेलिस्ट '{name}' को हटाना चाहते हैं? यह क्रिया पूर्ववत नहीं की जा सकती।

# empty_playlist_title
source: No Playlist Yet
hi: अभी तक कोई प्लेलिस्ट नहीं

# empty_playlist_message
source: Start by creating your first playlist. You can add playlists in Xtream Code or M3U format.
hi: अपनी पहली प्लेलिस्ट बनाकर शुरुआत करें। आप Xtream Code या M3U फॉर्मेट में प्लेलिस्ट जोड़ सकते हैं।

# empty_playlist_button
source: Create My First Playlist
hi: मेरी पहली प्लेलिस्ट बनाएं

source: Select Playlist Type
hi: प्लेलिस्ट प्रकार चुनें

# select_playlist_message
source: Choose the type of playlist you want to create
hi: आप जो प्लेलिस्ट बनाना चाहते हैं उसका प्रकार चुनें

# xtream_code_title
source: Connect with API URL, Username, and Password
hi: API URL, उपयोगकर्ता नाम और पासवर्ड के साथ कनेक्ट करें

# xtream_code_description
source: Easily connect with information from your IPTV provider
hi: अपने IPTV प्रदाता की जानकारी के साथ आसानी से कनेक्ट करें

# select_playlist_type_footer
source: Your playlist information is securely stored on your device.
hi: आपकी प्लेलिस्ट की जानकारी आपके डिवाइस पर सुरक्षित रूप से संग्रहीत है।

source: API URL required
hi: API URL आवश्यक है

source: Username
hi: उपयोगकर्ता नाम

# username_placeholder
source: Enter your username
hi: अपना उपयोगकर्ता नाम दर्ज करें

# username_required
source: Username is required
hi: उपयोगकर्ता नाम आवश्यक है

# username_min_3
source: Username should at least 3 character
hi: उपयोगकर्ता नाम में कम से कम 3 अक्षर होने चाहिए

source: Password
hi: पासवर्ड

# password_placeholder
source: Enter your password
hi: अपना पासवर्ड दर्ज करें

# password_required
source: Password is required
hi: पासवर्ड आवश्यक है

# password_min_3
source: Password should at least 3 character
hi: पासवर्ड में कम से कम 3 अक्षर होने चाहिए

source: Server URL
hi: सर्वर URL

# submitting
source: Saving...
hi: सेव हो रहा है...

# submit_create_playlist
source: Save Playlist
hi: प्लेलिस्ट सेव करें

source: Subscription Details
hi: सब्सक्रिप्शन विवरण

# subscription_remaining_day
source: Subscription: {days}
hi: सब्सक्रिप्शन: {days}

# remaining_day_title
source: Time Remaining
hi: शेष समय

# remaining_day
source: {days} Days
hi: {days} दिन

source: Connected
hi: कनेक्टेड

source: No Connection
hi: कोई कनेक्शन नहीं

source: Expired
hi: समाप्त

source: Active Connection
hi: सक्रिय कनेक्शन

source: Maximum Connection
hi: अधिकतम कनेक्शन

source: Server Information
hi: सर्वर की जानकारी

source: Time Zone
hi: समय क्षेत्र

source: Server Message
hi: सर्वर संदेश

# all_datas_are_stored_in_device
source: All data is securely stored on your device
hi: सभी डेटा आपके डिवाइस पर सुरक्षित रूप से संग्रहीत है

# url_format_validate_message
source: URL format should be like http://server:port
hi: URL फॉर्मेट http://server:port की तरह होना चाहिए

# url_format_validate_error
source: Please enter a valid URL (must start with http:// or https://)
hi: कृपया एक वैध URL दर्ज करें (http:// या https:// से शुरू होना चाहिए)

# playlist_name_already_exists
source: A playlist with this name already exists
hi: इस नाम की प्लेलिस्ट पहले से मौजूद है

# invalid_credentials
source: Could not get a response from your IPTV provider, please check your information
hi: आपके IPTV प्रदाता से प्रतिक्रिया नहीं मिल सकी, कृपया अपनी जानकारी जांचें

# error_occurred
source: An error occurred
hi: एक त्रुटि हुई

source: Connecting
hi: कनेक्ट हो रहा है

source: Preparing categories
hi: श्रेणियां तैयार की जा रही हैं

# preparing_categories_exception
source: Could not load categories: {error}
hi: श्रेणियां लोड नहीं हो सकीं: {error}

# preparing_live_streams
source: Loading live channels
hi: लाइव चैनल लोड हो रहे हैं

# preparing_live_streams_exception_1
source: Could not get live channels
hi: लाइव चैनल नहीं मिल सके

# preparing_live_streams_exception_2
source: Error loading live channels: {error}
hi: लाइव चैनल लोड करने में त्रुटि: {error}

# preparing_movies
source: Opening movie library
hi: फिल्म लाइब्रेरी खुल रही है

# preparing_movies_exception_1
source: Could not get movies
hi: फिल्में नहीं मिल सकीं

# preparing_movies_exception_2
source: Error loading movies: {error}
hi: फिल्में लोड करने में त्रुटि: {error}

# preparing_series
source: Preparing series library
hi: सीरियल लाइब्रेरी तैयार की जा रही है

# preparing_series_exception_1
source: Could not get series
hi: सीरियल नहीं मिल सके

# preparing_series_exception_2
source: Error loading series: {error}
hi: सीरियल लोड करने में त्रुटि: {error}

# preparing_user_info_exception_1
source: Could not get user information
hi: उपयोगकर्ता की जानकारी नहीं मिल सकी

# preparing_user_info_exception_2
source: Error loading user information: {error}
hi: उपयोगकर्ता की जानकारी लोड करने में त्रुटि: {error}

# m3u_playlist_title
source: Add playlist with M3U file or URL
hi: M3U फ़ाइल या URL के साथ प्लेलिस्ट जोड़ें

# m3u_playlist_description
source: Supports traditional M3U format files
hi: पारंपरिक M3U प्रारूप फ़ाइलों का समर्थन करता है

source: M3U Playlist
hi: M3U प्लेलिस्ट

# m3u_playlist_load_description
source: Load IPTV channels with M3U playlist file or URL
hi: M3U प्लेलिस्ट फ़ाइल या URL के साथ IPTV चैनल लोड करें

# playlist_name_hint
source: Enter playlist name
hi: प्लेलिस्ट का नाम दर्ज करें

# playlist_name_min_length
source: Playlist name must be at least 2 characters
hi: प्लेलिस्ट का नाम कम से कम 2 अक्षर का होना चाहिए

source: Source Type
hi: स्रोत प्रकार

source: File
hi: फ़ाइल

# m3u_url_required
source: M3U URL is required
hi: M3U URL आवश्यक है

# url_format_error
source: Enter a valid URL format
hi: एक वैध URL प्रारूप दर्ज करें

# url_scheme_error
source: URL must start with http:// or https://
hi: URL http:// या https:// से शुरू होना चाहिए

source: M3U File
hi: M3U फ़ाइल

source: File selected
hi: फ़ाइल चुनी गई

# select_m3u_file
source: Select M3U file (.m3u, .m3u8)
hi: M3U फ़ाइल चुनें (.m3u, .m3u8)

# please_select_m3u_file
source: Please select an M3U file
hi: कृपया एक M3U फ़ाइल चुनें

# file_selection_error
source: Error occurred while selecting file
hi: फ़ाइल चुनने में त्रुटि हुई

source: Processing...
hi: प्रसंस्करण...

source: Create Playlist
hi: प्लेलिस्ट बनाएं

# error_occurred_title
source: Error Occurred
hi: त्रुटि हुई

# m3u_info_message
source: All data is securely stored on your device. Supported formats: .m3u, .m3u8 URL format: Must start with http:// or https://
hi: सभी डेटा आपके डिवाइस पर सुरक्षित रूप से संग्रहीत है। समर्थित प्रारूप: .m3u, .m3u8 URL प्रारूप: http:// या https:// से शुरू होना चाहिए

# m3u_parse_error
source: M3U parsing error
hi: M3U पार्सिंग त्रुटि

source: Loading M3U
hi: M3U लोड हो रहा है

# preparing_m3u_exception_no_source
source: No M3U source found
hi: कोई M3U स्रोत नहीं मिला

# preparing_m3u_exception_empty
source: M3U file is empty
hi: M3U फ़ाइल खाली है

# preparing_m3u_exception_parse
source: M3U parsing error: {error}
hi: M3U पार्सिंग त्रुटि: {error}

# not_categorized
source: Uncategorized
hi: बिना श्रेणी

source: Loading Lists...
hi: सूचियां लोड हो रही हैं...

source: All
hi: सभी

source: IPTV Channels ({count})
hi: IPTV चैनल ({count})

source: Unknown Channel
hi: अज्ञात चैनल

# live_content
source: LIVE
hi: लाइव

# movie_content
source: MOVIE
hi: फिल्म

# series_content
source: SERIES
hi: सीरीज

# media_content
source: MEDIA
hi: मीडिया

source: M3U Error
hi: M3U त्रुटि

# episode_short
source: Ep
hi: एप

# season_number
source: {number}. Season
hi: सीजन {number}

# image_loading
source: Loading image...
hi: चित्र लोड हो रहा है...

source: Image Not Found
hi: चित्र नहीं मिला

source: Favorites
hi: पसंदीदा

# see_all_favorites
source: See All
hi: सभी देखें

source: Added to favorites
hi: पसंदीदा में जोड़ा गया

source: Removed from favorites
hi: पसंदीदा से हटाया गया
